add graph diagram
